<template>
  <div>
    <check-icon class="gray" :value="value" @update:value="$emit('input', $event)" type="plain">
      同意<span @click="show1 = true">《注册协议》</span>
    </check-icon>
    <x-dialog v-model="show1" hide-on-blur>
      <div class="wrap">
        <div class="title">服务协议</div>
        <div class="p agree-box">
<p>都可拉网（www.______________）所提供的各项服务和内容的所有权和运作权均归浙江都可拉网络科技有限公司及其关联公司（以下简称“都可拉”）所有。如果您在本网站、都可拉关联公司网站或其他都可拉提供的移动应用或软件上（以下简称“都可拉网”），访问、预定或使用我们的产品或服务（以上统称为“服务”），便视为您接受了以下服务协议，请仔细阅读以下内容。如果您不同意以下任何内容，请立刻停止访问本网站或使用本网站服务。</p>
<p>一、协议总则 </p>
<p>1、本协议内容包括协议正文、都可拉网子频道各单项服务协议及其他都可拉已经发布的或将来可能发布的各类规则，包括但不限于 隐私政策、 免责声明、 知识产权声明、 权利声明等其他协议（“其他条款”）。如果本协议与“其他条款”有不一致之处，则以“其他条款”为准。除另行明确声明外，任何都可拉提供的服务均受本协议约束。</p>
<p>2、都可拉如制订、修改本协议及/或各类规则向用户提供基于互联网以及移动网的相关服务的，应在本页面及其相应页面提前公布通知，您应该定期登陆本页面及其他相关页面，了解最新的协议内容。变更后的协议和规则在本页面及相关页面公布后七天，将自动生效。如您不同意相关变更，应当立即停止访问都可拉网或使用都可拉服务。若您在网站协议和规则变更七日后继续使用都可拉服务的，即表示您接受已经修订的协议和规则。</p>
<p>3、若您作为都可拉的关联公司或合作公司的用户登陆都可拉平台，访问都可拉网站或使用都可拉服务，即视为您同意本协议的所有条款及都可拉公布的其他规则、说明和操作指引。</p>
<p>二、用户权利</p>
<p>在您完成注册申请手续后，意味着您已获得都可拉账户（用户名）的使用权。您应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。您应妥善保管您的账户（用户名）和密码，通过您的账户（用户名）和密码操作或实施的行为，将视为您本人的行为，由您本人承担相应的责任和后果。如果您发现他人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以书面、有效方式通知都可拉，要求都可拉暂停相关服务。在此，您理解都可拉对您的请求采取行动需要合理时间，都可拉对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</p>
<p>三、使用规则</p>
<p>1、您可自行注册账号名称，编辑头像、简介等注册信息，但您承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，并遵守《互联网用户账号名称管理规定》及相关管理规定，且账号名称、头像和简介等注册信息中不得含有违法和不良信息，包括但不限于下列情形：</p>
<p>1） 违反宪法或法律法规规定的；</p>
<p>2） 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
<p>3） 损害国家荣誉和利益的，损害公共利益的；</p>
<p>4） 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
<p>5） 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
<p>6） 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
<p>7） 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
<p>8） 侮辱或者诽谤他人，侵害他人合法权益的；</p>
<p>9） 含有法律、行政法规禁止的其他内容的。</p>
<p>您使用都可拉账号，制作、发布、传播信息内容的，应当使用真实身份信息及个人资料，不得以虚假、冒用的身份信息进行注册；若您的个人资料有任何变动，应及时更新。因您以虚假信息骗取账号名称注册，或您账号头像、简介等注册信息存在违法和不良信息的，或利用都可拉账号实施重复侵权行为的，都可拉有权采取通知您限期改正、暂停使用、注销登记等措施。</p>
<p>2、您在使用都可拉服务时，必须遵守中华人民共和国相关法律法规的规定，您应同意将不会利用该服务进行任何违法或不正当的活动，包括但不限于下列行为:</p>
<p>2.1  上载、展示、张贴、传播或以其它方式传送含有下列内容之一的信息：</p>
<p>1）反对宪法所确定的基本原则的；</p>
<p>2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
<p>3）损害国家荣誉和利益的；</p>
<p>4）煽动民族仇恨、民族歧视、破坏民族团结的；</p>
<p>5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
<p>6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
<p>7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
<p>8）侮辱或者诽谤他人，侵害他人合法权利的；</p>
<p>9）含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</p>
<p>10） 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。</p>
<p>2.2  为任何非法目的而使用网络服务系统。</p>
<p>2.3  利用都可拉网络服务从事以下活动：</p>
<p>1）未经允许，进入计算机信息网络或者使用计算机信息网络资源的； 未经允许，对计算机信息网络功能进行删除、修改或者增加的；未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；故意制作、传播计算机病毒等破坏性程序的；其他危害计算机信息网络安全的行为</p>
        </div>
        <div class="btn-foot" @click="show1 = false">同意并继续</div>
      </div>
    </x-dialog>
  </div>
</template>
<script>
import { XDialog, CheckIcon } from 'vux'
export default {
  components: {
    XDialog, CheckIcon
  },
  props: ['value'],
  data() {
    return {
      show1: false,
      readed: false
    }
  }
}
</script>
<style scoped lang="less">
@import '../styles/login.less';
.agree-box{
  max-height: 300px;
  overflow: auto;
}
</style>
